Revit 2027 API
BuiltInFailures.ElevationFailures.WarnElevSheet Property
 An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WarnElevSheet { get; }
Public Shared ReadOnly Property WarnElevSheet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WarnElevSheet {
	FailureDefinitionId^ get ();
}
static member WarnElevSheet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElevationFailures Class
Autodesk.Revit.DB Namespace